NikolayBobovnikov/ircapture/auvir_embed/mocap/transmitter/stm32f103/Src/main.c
                // transitional state
                // TODO: check if possible to move to beginning of next state (thus remove delay)
                case STAGE_ON2:
                {
                    phtim_envelop->Instance->ARR = PeriodBetweenDataFrames;
                    StartStopSequenceTransmitState = STAGE_0;
                    TransmitterState = TX_DELAY;
                    break;
                }
            }
            break;
        }
        case TX_DELAY:
        {
            reset_transmitter();
            break;
        }
    } // switch(TransmitterState)
}
void reset_transmitter()
{
    TransmitterState = TX_WAITING;
    // TODO: add other steps if needed
    phtim_envelop->Instance->ARR = PeriodOfStartStopBits;
    StartStopSequenceTransmitState = STAGE_0;
    DataFrameState = DATAFRAME_0_NODATA;
}

void switch_to_data_transmission_state()
{
    TransmitterState = TX_DATA;
    DataFrameState = DATAFRAME_1_BEAMER_ID;
    StartStopSequenceTransmitState = STAGE_0;
    tx_current_bit_pos = 0;
    force_envelop_timer_output_off();
}
void transmit_data_frame_part()
{
    switch(DataFrameState)
    {
        default:
        {
            reset_transmitter();
            return;
        }
        case(DATAFRAME_1_BEAMER_ID):
        {
            tx_total_bits = sizeof(tx_data_frame._1_beamer_id) * 8;
            tx_bit = (tx_data_frame._1_beamer_id >> (tx_total_bits - tx_current_bit_pos - 1)) & 1;
            p_w_modulate(tx_bit);
            // go to next bit.
            if(tx_current_bit_pos < tx_total_bits)
            {
                tx_current_bit_pos++;
            }
            else
            {
                // change state to process next part of data
                DataFrameState = DATAFRAME_2_ANGLE;
                tx_current_bit_pos = 0;
            }
            break;
        }
        case(DATAFRAME_2_ANGLE):
        {
            tx_total_bits = sizeof(tx_data_frame._2_angle_graycode) * 8;
            tx_bit = (tx_data_frame._2_angle_graycode >> (tx_total_bits - tx_current_bit_pos - 1)) & 1;
            p_w_modulate(tx_bit);
            // go to next bit.
            if(tx_current_bit_pos < tx_total_bits)
            {
                tx_current_bit_pos++;
            }
            else
            {
                // change state to process next part of data
                DataFrameState = DATAFRAME_3_TIME;
                tx_current_bit_pos = 0;
            }
            break;
        }
        case(DATAFRAME_3_TIME):
        {
            tx_total_bits = sizeof(tx_data_frame._3_timer_cnt) * 8;
            tx_bit = (tx_data_frame._3_timer_cnt >> (tx_total_bits - tx_current_bit_pos - 1)) & 1;
            p_w_modulate(tx_bit);
            // go to next bit.
            if(tx_current_bit_pos < tx_total_bits)
            {
                tx_current_bit_pos++;
            }
            else
            {
                // change state to finish processing data
                // sending data using separate PWM channels is finished,
                // return to default PWM channel
                currentOutputTimChannel = primary_output_channel;

                /* Set the Autoreload value for start sequence bits*/
                phtim_envelop->Instance->ARR = PeriodOfStartStopBits;

                // move on to next stage
                TransmitterState = TX_STOP_BIT;
                DataFrameState = DATAFRAME_0_NODATA;
                tx_current_bit_pos = 0;
            }
            break;
        }
    }

    /* Generalized version
    switch (total_bits)
    {
        default:
        {
            reset_transmitter();
            return;
        }
        case 8:
        {
            tx_bit = (*((uint8_t*)(data)) >> (total_bits - tx_current_bit_pos - 1)) & 1;
            break;
        }
        case 16:
        {
            tx_bit = (*((uint16_t*)(data)) >> (total_bits - tx_current_bit_pos - 1)) & 1;
            break;
        }
        case 32:
        {
            tx_bit = (*((uint32_t*)(data)) >> (total_bits - tx_current_bit_pos - 1)) & 1;
            break;
        }
    }
    */
}

void p_w_modulate(uint8_t bit)
{
    if(bit == 1)
    {
        force_envelop_timer_output_on();
    }
    else // bit == 0
    {
        force_envelop_timer_output_off();
    }

}

void force_envelop_timer_output_on()
{
    // Start pwm timer, depending on timer and channel number
    switch(currentOutputTimChannel)
    {
        case Timer2Channel1:
        {
            HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1); // carrier
            break;
        }
        case Timer2Channel2:
        {
            HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_2); // carrier
            break;
        }
        case Timer2Channel3:
        {
            HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_3); // carrier
            break;
        }
        case Timer2Channel4:
        {
            HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_4); // carrier
            break;
        }
        case Timer3Channel1:
        {
            HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1); // carrier
            break;
        }
        case Timer3Channel2:
        {
            HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_2); // carrier
            break;
        }
        case Timer3Channel3:
        {
            HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_3); // carrier
            break;
        }
        case Timer3Channel4:
        {
            HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_4); // carrier
            break;
        }
        case Timer4Channel1:
        {
            HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_1); // carrier
            break;
        }
        case Timer4Channel2:
        {
            HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_2); // carrier
            break;
        }
        case Timer4Channel3:
        {
            HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_3); // carrier
            break;
        }
        case Timer4Channel4:
        {
            HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_4); // carrier
            break;
        }
    }

    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
}

